perf/tests/ping/pocos_users_muchas_reqs/ramp.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "ramp-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "ramp-gunicorn"

  pool: 100

  phases:
    - name: Plain
      duration: 15
      arrivalRate: 0
    - name: Ramp
      duration: 120
      arrivalRate: 0
      rampTo: 40
    - name: Plain
      duration: 15
      arrivalRate: 0

scenarios:
  - name: load testing 3 (/)
    flow:
      - loop:
        - get:
            url: "/ping"
        count: 80